In [ ]:
import pandas as pd

In [37]:
df = pd.read_csv('Dados/CHURN_CREDIT_MOD14_TRATADO.csv')

### Padronizando ---> Renomeando a coluna Balance para Balanco

In [38]:
df.rename(columns = {'Balance': 'Balanco'}, inplace = True)
df.head(5)

,Unnamed: 0,Credit_Score,Pais,Genero,Idade,Tempo_Credito,Balanco,Qtd_Produtos,Possui_Cartao,Membro_Ativo,Salario_Anual,Churn
0,0,677,SPAIN,Male,18.0,5,134796.87,2,1.0,0.0,10787603.0,0.0
1,1,644,SPAIN,Female,18.0,7,0.00,1,0.0,1.0,10787603.0,0.0
2,2,641,SPAIN,Male,18.0,1,0.00,2,0.0,1.0,10787603.0,0.0
3,3,826,SPAIN,Male,18.0,2,0.00,2,0.0,1.0,10787603.0,0.0
4,4,774,SPAIN,Female,18.0,1,185891.54,1,1.0,0.0,10787603.0,0.0

### Tratando os valores da coluna Pais

In [ ]:
df['Pais'].value_counts()

In [ ]:
# TRANSFORMANDO TODOS OS DADOS DA COLUNA EM CAIXA BAIXO (MINÚSCULA)
df['Pais'] = df['Pais'].str.lower()
df['Pais'].unique()

In [ ]:
# TRANSFORMANDO TODOS OS DADOS DA COLUNA EM CAIXA BAIXO (MAIÚSCULA)
df['Pais'] = df['Pais'].str.upper()
df['Pais'].unique()

Padronizando as categorias

In [ ]:
df['Pais'] = df['Pais'].replace('GERMANI', 'GERMANY')
df['Pais'].unique()

### Verificando a coluna de gênero

In [ ]:
df['Genero'].unique()

### Retirando as colunas de Sobrenome e CustomerId

In [40]:
df.drop(columns = ['Sobrenome'], inplace = True)
df.drop(columns = ['CustomerId'], inplace = True)
df.drop(columns = ['Unnamed: 0'], inplace = True)

In [41]:
df.head(5)

,Credit_Score,Pais,Genero,Idade,Tempo_Credito,Balanco,Qtd_Produtos,Possui_Cartao,Membro_Ativo,Salario_Anual,Churn
0,677,SPAIN,Male,18.0,5,134796.87,2,1.0,0.0,10787603.0,0.0
1,644,SPAIN,Female,18.0,7,0.00,1,0.0,1.0,10787603.0,0.0
2,641,SPAIN,Male,18.0,1,0.00,2,0.0,1.0,10787603.0,0.0
3,826,SPAIN,Male,18.0,2,0.00,2,0.0,1.0,10787603.0,0.0
4,774,SPAIN,Female,18.0,1,185891.54,1,1.0,0.0,10787603.0,0.0

### Salvando o DataFrame

In [42]:
df.to_csv('Dados/CHURN_CREDIT_MOD14_TRATADO.csv', index = False, encoding = 'utf-8')
df_tratado = pd.read_csv('Dados/CHURN_CREDIT_MOD14_TRATADO.csv')
df_tratado.head(5)

,Credit_Score,Pais,Genero,Idade,Tempo_Credito,Balanco,Qtd_Produtos,Possui_Cartao,Membro_Ativo,Salario_Anual,Churn
0,677,SPAIN,Male,18.0,5,134796.87,2,1.0,0.0,10787603.0,0.0
1,644,SPAIN,Female,18.0,7,0.00,1,0.0,1.0,10787603.0,0.0
2,641,SPAIN,Male,18.0,1,0.00,2,0.0,1.0,10787603.0,0.0
3,826,SPAIN,Male,18.0,2,0.00,2,0.0,1.0,10787603.0,0.0
4,774,SPAIN,Female,18.0,1,185891.54,1,1.0,0.0,10787603.0,0.0